[![Open In Colab](https://colab.research.google.com/assets/colab-badge.svg)](http://colab.research.google.com/github/Jonas-Metz-verovis/verovis_Coding_Challenge/blob/main/01_Data_Loading_Solution.ipynb)

# Introduction

In this Challenge you will learn how to load Data from CSV-Files and a SAP HANA Database and perform basic Operations on the loaded DataFrame.

The Documentation of the relevant Functionalities/Packages can be found here:

1.  [Import Packages](https://docs.python.org/3.7/reference/import.html)
1.  [Console Input/Output](https://docs.python.org/3.7/tutorial/inputoutput.html)
1.  [Read CSV-Files with Pandas](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html)
1.  [Pandas DataFrame API](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html)
1.  [Pandas Row/Column/Cell Selection](https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html)
1.  [Pandas DataFrame Combination](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)
1.  [Basic Directory/File Operations](https://docs.python.org/3.7/library/os.html)
1.  [Python Database Connections (DB-API Specification)](https://www.python.org/dev/peps/pep-0249/)
1.  [Database Connections with SQLAlchemy](https://docs.sqlalchemy.org/en/14/)
1.  [SAP HANA Connection (HDBCLI)](https://help.sap.com/viewer/0eec0d68141541d1b07893a39944924e/2.0.04/en-US/d12c86af7cb442d1b9f8520e2aba7758.html) / [SQLAlchemy: SAP HANA](https://help.sap.com/viewer/f1b440ded6144a54ada97ff95dac7adf/2.4/en-US/01e93e584e524747b570cd9083b08d2b.html)
1.  [Pandas DataFrame from SQL](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_sql.html) / [to SQL](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_sql.html)

Info: These are Links to the official Documentation of Python and the used Packages. While comprehensive, they sometimes can be confusing. To find a Solution to a given Problem, it often works well if one just "googles the problem". Great Sources are:

1.  [TowardsDataScience](https://towardsdatascience.com/)
1.  [StackOverflow](https://stackoverflow.com/)
1.  [Python-Kurs.eu](https://www.python-kurs.eu/python3_kurs.php)
1.  [Python Data Science Handbook](https://github.com/jakevdp/PythonDataScienceHandbook)
1.  [The Hitchhiker's Guide to Python](https://docs.python-guide.org/)
1.  [Overview of Data Science YouTube Channels](https://towardsdatascience.com/top-20-youtube-channels-for-data-science-in-2020-2ef4fb0d3d5)
1.  [Introduction to Machine Learning with Python](https://github.com/amueller/introduction_to_ml_with_python) / [Buy the Book](https://www.amazon.de/Introduction-Machine-Learning-Python-Scientists/dp/1449369413)
1.  [The Elements of Statistical Learning](https://web.stanford.edu/~hastie/ElemStatLearn/printings/ESLII_print12_toc.pdf)
1.  [Bayesian Reasoning and Machine Learning](http://web4.cs.ucl.ac.uk/staff/D.Barber/textbook/200620.pdf)
1.  [Deep Learning](https://www.deeplearningbook.org/)

# Imports

### Info (Google Colab)

If you are working in Google Colab, you must install the SAP HANA Python Driver to be able to connect to a SAP HANA Database!

```
!pip install hdbcli
```

Furthermore you must install the SAP HANA Engine if you want to connect to the SAP HANA Database using SQLAlchemy!

```
!pip install sqlalchemy-hana
```

### Task: Import all necessary Python Packages.

In [13]:
import os
import pandas as pd
from hdbcli import dbapi
from sqlalchemy import create_engine

# Data Loading

### Task: Load the Data from these CSV-Files into separate Pandas DataFrames and visualize their Content (Top/Bottom-5-Rows and Summary Statistics).

1.  Titanic Train Data: https://raw.githubusercontent.com/Jonas-Metz-verovis/verovis_Coding_Challenge/main/Data/Titanic_Train.csv
1.  Titanic Test Data: https://raw.githubusercontent.com/Jonas-Metz-verovis/verovis_Coding_Challenge/main/Data/Titanic_Test.csv
1.  Titanic Test Target: https://raw.githubusercontent.com/Jonas-Metz-verovis/verovis_Coding_Challenge/main/Data/Titanic_Test_Target.csv

In [14]:
df_raw_train = pd.read_csv ("https://raw.githubusercontent.com/Jonas-Metz-verovis/verovis_Coding_Challenge/main/Data/Titanic_Train.csv")
df_raw_train.head ()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [15]:
df_raw_train.tail ()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [16]:
df_raw_train.describe ( )

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [17]:
df_raw_test = pd.read_csv ("https://raw.githubusercontent.com/Jonas-Metz-verovis/verovis_Coding_Challenge/main/Data/Titanic_Test.csv")
df_raw_test.head ()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [18]:
df_raw_test.tail ()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [19]:
df_raw_test.describe ()

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

In [20]:
df_raw_test_target = pd.read_csv ("https://raw.githubusercontent.com/Jonas-Metz-verovis/verovis_Coding_Challenge/main/Data/Titanic_Test_Target.csv")
df_raw_test_target.head ()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [21]:
df_raw_test_target.tail ()

     PassengerId  Survived
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

In [22]:
df_raw_test_target.describe ()

       PassengerId    Survived
count   418.000000  418.000000
mean   1100.500000    0.363636
std     120.810458    0.481622
min     892.000000    0.000000
25%     996.250000    0.000000
50%    1100.500000    0.000000
75%    1204.750000    1.000000
max    1309.000000    1.000000

# Data Combination

### Task: Add an Train/Test Identifier Column to the DataFrames and combine them into one DataFrame which contains all Columns/Rows.

In [23]:
df_raw_train ["Test"] = 0
df_raw_test ["Test"] = 1

In [24]:
df_raw_test = df_raw_test.merge (df_raw_test_target, how="left", on="PassengerId")
df_raw_test.head ()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Test,Survived
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,1,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,1,1
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,1,0
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,1,0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,1,1

In [25]:
df_raw_combined = pd.concat ([df_raw_train, df_raw_test], ignore_index=True)
df_raw_combined.tail ()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Test
1304,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S,1
1305,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C,1
1306,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S,1
1307,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S,1
1308,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C,1

# Data Saving

### Info (Google Colab)

If you are working in Google Colab, you can save the Results to your Google Drive by running

```
from google.colab import drive
drive.mount("/content/drive")
```

You will be requested to authenticate with your Google Account.

The Path to your Google Colab Notebooks Folder will be "/content/drive/My Drive/Colab Notebooks".

The Commands can then use this Path:

```
os.makedirs ("/content/drive/My Drive/Colab Notebooks/Results", exist_ok=True)
df_raw_combined.to_csv ("/content/drive/My Drive/Colab Notebooks/Results/Titanic_Combined.csv", index=False)
```

### Task: Save the combined DataFrame to a CSV-File.

In [26]:
os.makedirs ("Results", exist_ok=True)
df_raw_combined.to_csv ("Results/Titanic_Combined.csv", index=False)

# Basic DataFrame Operations

### Task: Print a List of the combined DataFrame's Columns.

In [27]:
print (df_raw_combined.columns.to_list ())

['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'Test']

### Task: Print the Value of the Cell in Row 1305 / Column 4

In [28]:
print (df_raw_combined.iloc [1305, 4])

female

### Task: Print the Age of the Passenger "Karlsson, Mr. Nils August"

In [29]:
print (df_raw_combined.loc [df_raw_combined ["Name"] == "Karlsson, Mr. Nils August", "Age"].iloc [0])

22.0

# Database Connections (SAP HANA)

### Task: Connect to the verovis SAP HANA Database (you will get the necessary Connection Information from your Instructor)

In [30]:
server = ""
port = 0
user_name = ""
user_password = ""

In [31]:
connection = dbapi.connect (address = server, port = port, user = user_name, password = user_password)
cursor = connection.cursor ()

connection_string = user_name + ":" + user_password + "@" + server + ":" + str(port)
sql_alchemy_engine = create_engine("hana://" + connection_string)

### Task: Load the Content of the Table "TITANIC_TRAIN" in Schema "CODING_CHALLENGE" into a Pandas DataFrame

In [32]:
df_raw_train_database = pd.read_sql ("SELECT * FROM CODING_CHALLENGE.TITANIC_TRAIN;", sql_alchemy_engine)
df_raw_train_database.head ()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,None,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,None,S

### Task: Upload the Pandas DataFrame to a new Table "YOURNAME_UPLOAD" in Schema "CODING_CHALLENGE"

In [33]:
df_raw_train_database.to_sql (name = "JONAS_UPLOAD", schema = "CODING_CHALLENGE", con = sql_alchemy_engine, if_exists="replace", index = False)

### Task: Delete the Table from the Database

In [34]:
cursor.execute ("DROP TABLE CODING_CHALLENGE.JONAS_UPLOAD;")

True

### End the Database Connection

In [35]:
connection.close ()